In [31]:
import pymysql
from sqlalchemy import create_engine, text
import pandas as pd

In [2]:
%load_ext sql

### 方式一：隐式连接
连接后可以用魔术语句标记后直接运行sql

In [3]:
%sql mysql+pymysql://root:231500@127.0.0.1:3306/atguigudb

In [4]:
%%sql
SELECT last_name,job_id,salary
FROM employees
WHERE salary = (
                SELECT MIN(salary)
                FROM employees
                );

 * mysql+pymysql://root:***@127.0.0.1:3306/atguigudb
1 rows affected.

[('Olson', 'ST_CLERK', 2100.0)]

### 方式二：显示连接
建立连接后，`pandas`可以通过`connection`获取`sql`执行的结果

In [8]:
conn = pymysql.connect(
                        host = 'localhost',
                        user = 'root',
                        password='231500',
                        db = 'atguigudb',
                        port =3306,
                        charset = 'utf8')

如果想用多行`sql`语句，用三双引号即可。<br>
三双引号：允许一个字符串跨行书写

In [20]:
sql_l = """
SELECT last_name,job_id,salary 
FROM employees 
WHERE salary = (SELECT MIN(salary) 
                FROM employees );
"""

In [22]:
data = pd.read_sql(sql_l, conn)
data

  last_name    job_id  salary
0     Olson  ST_CLERK  2100.0

In [23]:
#关闭连接
conn.close

### 方式三：`sqlalchemy`连接`engine`

In [4]:
host = 'localhost'
port = 3306
user = 'root'
password = '231500'
database = 'world'

engine = create_engine(f'mysql+pymysql://{user}:{password}@{host}/{database}')

#### `pandas`从`mysql`读取数据

In [6]:
sql = "select ID, Name, CountryCode, District, Population from city"
df_sql = pd.read_sql(sql, engine)

#### `dataframe`写入`mysql`

In [13]:
df_sql.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [25]:
new_row = {
    'ID': [4999, 5000],
    'Name': ['Richard Jin', 'Ryan'],
    'CountryCode': ['AFG', 'NLD'],
    'District': ['Kabol', 'Qandahar'],
    'Population': [9999, 9999]}

In [26]:
df_w = pd.DataFrame(new_row)

In [27]:
df_w.to_sql(name='city', con=engine, if_exists='append', index=False)

2

#### 用`conn`执行`sql`语句

In [38]:
query = 'select count(*) from city'
with engine.connect() as conn:
    result = conn.execute(text(query))
    print(result.all())

[(4081,)]